src/cf/InformationRegisters/СостоянияДокументовМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовМЭДО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - генерируется наш GUID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметСообщения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметСообщенияМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийМЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияДокументовМЭДО/Ext/RecordSetModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновить РС актуальных состояний для показа в форме списка:
	Для Каждого Запись Из ЭтотОбъект Цикл
		ОбновитьАктуальноеСостояние(Запись.Документ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновить актуальное состояние.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ПредметМЭДО - Документ
//  Состояние - ПеречислениеСсылка.СостоянияДокументовМЭДО - Состояние, какое нужно записать.
Процедура ОбновитьАктуальноеСостояние(Документ)
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СрезСостояния = РегистрыСведений.СостоянияДокументовМЭДО.СрезСостоянияДокумента(
		Документ, Неопределено, "Состояние", ТекущаяДатаСеанса(), Неопределено);
	Если Не ЗначениеЗаполнено(СрезСостояния.Состояние) Тогда
		СрезСостояния.Состояние = Перечисления.СостоянияДокументовМЭДО.ПустаяСсылка();
	КонецЕсли;
	
	МЭДОПереопределяемый.ЗаписатьСостояниеДокумента(Документ, СрезСостояния.Состояние);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
